NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/multiphase/interFoam/RAS/waterChannel/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

restore0Dir

runApplication setFields

runApplication $(getApplication)

#------------------------------------------------------------------------------
